/* 

Write a loop 1 to 200. Use break to exit the loop once you find 100.

*/

for (let century = 0; century < 200; century ++){
    console.log(century);
    if (century >= 100){
        break;
    }
}



/***
 * ব্যাখ্যা (বাংলা):
for (let century = 0; century < 200; century++)
এখানে একটা লুপ শুরু হয়েছে যেখানে century নামক ভ্যারিয়েবল ০ থেকে শুরু করে প্রতি ধাপে ১ করে বাড়বে, যতক্ষণ century ২০০ এর নিচে থাকবে।

console.log(century);
প্রতি ধাপে বর্তমান century এর মান কনসোলে প্রিন্ট হবে।

if (century >= 100)
চেক করা হচ্ছে যদি century এর মান ১০০ বা তার বেশি হয় তাহলে...

break;
লুপকে অবিলম্বে থামিয়ে দেওয়া হবে।

সারাংশ:
লুপ ০ থেকে শুরু করে ১০০ পর্যন্ত সংখ্যা প্রিন্ট করবে।

১০০ এ পৌঁছানোর পর লুপ ব্রেক হয়ে যাবে এবং ১০১ থেকে ১৯৯ পর্যন্ত লুপ আর চলবে না।

তুমি basically ০ থেকে ১০০ পর্যন্ত সংখ্যা দেখতে পারবে, যদিও শর্তে ২০০ পর্যন্ত চলার কথা ছিলো।
 */